
import numpy as np
import pandas as pd

tp1 = [ '滑油总管压力', '1号电动滑油泵滑油出口压力', '滑油总管温度', '滑油总管流量', '滑油总管再循环滑油流量',
       '滑油压力调节阀开度指令', '滑油压力调节阀开度反馈', '2号电动滑油输送泵滑油出口压力', '滑油温度调节阀开度指令',
       '滑油温度调节阀开度反馈', '汽轮主机模拟装置滑油入口调节阀阀门开度指令', '汽轮主机模拟装置滑油入口调节阀开度反馈',
       '滑油冷却器滑油进口温度', '汽轮主机减速器模拟装置滑油入口调节阀开度指令', '汽轮主机减速器模拟装置滑油入口调节阀开度反馈',
       '滑油冷却器滑油出口温度', '汽轮发电机组模拟装置滑油入口调节阀开度指令', '汽轮发电机组模拟装置滑油入口调节阀开度反馈',
       '汽轮主机模拟装置滑油入口流量', '主推力轴承模拟装置滑油入口调节阀开度指令', '主推力轴承模拟装置滑油入口调节阀开度反馈',
       '汽轮主机模拟装置滑油入口压力', '汽轮主机模拟装置调节阀阀门开度指令', '汽轮主机模拟装置调节阀开度反馈',
       '汽轮主机模拟装置滑油出口温度', '汽轮主机减速器模拟装置调节阀阀门开度指令', '汽轮主机减速器模拟装置调节阀开度反馈',
       '汽轮主机减速器模拟装置滑油入口流量', '汽轮发电机组模拟装置调节阀阀门开度指令', '汽轮发电机组模拟装置调节阀开度反馈',
       '汽轮主机减速器模拟装置滑油入口压力', '主推力轴承模拟装置调节阀阀门开度指令', '主推力轴承模拟装置调节阀开度反馈',
       '汽轮主机减速器模拟装置滑油出口温度', '汽轮凝水泵组模拟装置调节阀阀门开度指令', '汽轮凝水泵组模拟装置调节阀开度反馈',
       '汽轮发电机组模拟装置滑油入口流量', '汽轮给水泵组模拟装置调节阀阀门开度指令', '汽轮给水泵组模拟装置调节阀开度反馈',
       '汽轮发电机组模拟装置滑油入口压力', '汽轮滑油泵组模拟装置调节阀阀门开度指令', '汽轮滑油泵组模拟装置调节阀开度反馈',
       '汽轮发电机组模拟装置滑油出口温度', '汽轮辅循环水泵模拟装置调节阀阀门开度指令', '汽轮辅循环水泵模拟装置调节阀开度反馈',
       '主推力轴承模拟装置滑油入口流量', '滑油加热器1号功率', '滑油加热器1号加热器出口温度', '主推力轴承模拟装置滑油入口压力',
       '滑油加热器2号功率', '滑油加热器2号加热器出口温度', '主推力轴承模拟装置滑油出口温度', '汽轮凝水泵组模拟装置滑油入口流量',
       '汽轮凝水泵组模拟装置滑油入口压力', '汽轮凝水泵组模拟装置滑油出口温度', '汽轮给水泵组模拟装置滑油入口流量',
       '汽轮给水泵组模拟装置滑油入口压力', '汽轮给水泵组模拟装置滑油出口温度', '汽轮滑油泵组模拟装置滑油入口流量',
       '汽轮滑油泵组模拟装置滑油入口压力', '汽轮滑油泵组模拟装置滑油出口温度', '汽轮辅循环水泵模拟装置滑油入口流量',
       '汽轮辅循环水泵模拟装置滑油入口压力', '汽轮辅循环水泵模拟装置滑油出口温度', '电动滑油泵1号变频泵转速指令',
       '电动滑油泵1号变频泵转速反馈', '电动滑油泵2号变频泵转速指令', '电动滑油泵2号变频泵转速反馈', '滑油冷却器1号滑油入口压力',
       '滑油冷却器1号滑油出口压力', '滑油冷却器1号冷却水入口温度', '滑油冷却器1号冷却水出口温度']

from sklearn.decomposition import PCA
# x = np.array([[-1,6,-1,2],[-2,14,-1,3],[-3,34,-2,6],[1,1,23,1],[2,1,1,8],[3,4,2,9]])
# print(x)
df = pd.read_csv('scan_data2.csv',encoding='gbk')[tp1]
print(df)
# print(len(df.columns)) = 72

x = np.array(df)
pca = PCA(n_components=72)                           #说明只选取一个主方向，降到一维
result = pca.fit_transform(x)                       #对原始数据进行降维保存在result中
print(result)
# PCA(copy=True,n_components=3,whiten=False)
print(pca.explained_variance_ratio_)
# [0.99244289 0.00755711]  可以理解为单个变量的方差贡献率偏差

